from make_test import process


def test_should_preserve_structure() -> None:
    text = """ΤΙ ΔΕΝ ΠΡΕΠΕΙ ΝΑ ΞΕΧΑΣΩ  - Η επανάσταση στην πληροφορική...    

    - Η πληροφορική συνέβαλε κ.ά. Όμως:  - Η πληροφορική,... - Στην Εκκλησία ευλογείται..
    Αποστολή σε όλον τον κόσμο.

    ... Να υποτάσσεστε ο ένας στον άλλο με φόβο Χριστού.  Εφεσ. 5, 21-33"""
    clean_text, wrong_text = process(text)
    assert clean_text == wrong_text


def test_should_preserve_structure_two() -> None:
    text = """
της σε όλον τον κόσμο.

ΕΧΟΥΝ ΣΗΜΑΣΙΑ ΑΥΤΑ ΓΙΑ ΤΗ ΖΩΗ ΜΟΥ;  1. Το να κάθεσαι μπροστά σε έναν υπολογιστή όλον τον ελεύθερο χρόνο σου και να βλέπεις ανεξέλεγκτα οτιδήποτε είναι θετικό για την πρόοδο σου; 2. Η πληροφορία και η γνώση μπορούν από μόνες τους να εξυψώσουν τον άνθρωπο και την κοινωνία; 3. Σε τι δυσκολεύει τη ζωή του ανθρώπου η άνευ όρων καταγραφή πληροφοριών της προσωπικής του ζωής; 4. Η Εκκλησία γιατί να χρησιμοποιεί την πληροφορική;


**************


17. ΜΟΝΑΞΙΑ ΚΑΙ ΑΝΘΡΩΠΙΝΕΣ ΣΧΕΣΕΙΣ

Σκοπός αυτής της διδακτικής ενότητας είναι: • Να γνωρίσετε τον τρόπο με τον οποίο τα δύο φύλα μπορούν να ζήσουν αρμονικά χωρίς αντιπαλότητα. • Να γνωρίσετε τα αίτια που δημιουργούν στον άνθρωπο τη μοναξιά. • Να γνωρίσετε τη λύση που προτείνει η Εκκλησία κατά της μοναξιάς.

...Να υποτάσσεστε
    """
    clean_text, wrong_text = process(text)
    assert clean_text == wrong_text
